tap "cmacrae/formulae"
tap "domq/gdb"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "oclint/formulae"
tap "universal-ctags/universal-ctags"


brew "bat"
brew "black"
brew "blueutil"
brew "ccls"
brew "clang-format"
brew "cmake-docs"
brew "cppman"
brew "ctags", link: false
brew "curl"
brew "fd"
brew "figlet"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "glfw"
brew "glow"
brew "go"
brew "openjdk"
brew "google-java-format"
brew "googletest"
brew "jq"
brew "pkg-config"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "mas"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "node@16"
brew "nvm"
brew "pandoc"
brew "perl"
brew "prettier"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "spaceship"
brew "starship"
brew "stow"
brew "stylua"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "w3m"
brew "wget"
brew "xclip"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]


cask "caffeine"
cask "docker"
cask "font-hack-nerd-font"
cask "julia"
cask "kap"
cask "mactex"
cask "zoom"
