tap "buo/cask-upgrade"
tap "cmacrae/formulae"
tap "domq/gdb"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bat"
brew "bear"
brew "black"
brew "ccls"
brew "clang-format"
brew "cppman"
brew "curl"
brew "exa"
brew "figlet"
brew "flac"
brew "gcc"
brew "gh"
brew "git"
brew "glfw"
brew "go"
brew "openjdk"
brew "google-java-format"
brew "lf"
brew "llvm"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "mas"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "nvm"
brew "perl"
brew "pkg-config"
brew "portaudio"
brew "prettier"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "starship"
brew "stylua"
brew "thefuck"
brew "tldr"
brew "trash-cli"
brew "tree"
brew "uncrustify"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "fig"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "julia"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "zoom"
mas "GoodNotes", id: 1444383602
